app/Controllers/Home.php

SELECT *
FROM `genero`
SELECT *
FROM `autor`
---

        // Obtenemos la lista de géneros para armar el menú desplegable (select) en la vista
        //$generos = $generoModel->findAll();
        $data['generos'] = $generoModel->findAll();

        // Preparamos el arreglo de datos que le vamos a enviar a las vistas
        $data['autores'] = \Config\Database::connect()->table('autor')->get()->getResultArray();